In [9]:
import pandas as pd
Test_data=pd.read_excel("Test_file.xlsx", sheet_name=0, header=0,  index_col=0, usecols=range(5))
print(Test_data)

    A  B    C    D
R1  1  2  3.0    4
R2  6  3  2.0  NaN
R3  3  7  1.0    1
R4  5  4  2.0    q
R5  2  2  6.0    7
R6  4  4  0.0    m
R7  3  2  NaN    w
R8  1  1  5.0    5

In [10]:
Test_data['A']

R1    1
R2    6
R3    3
R4    5
R5    2
R6    4
R7    3
R8    1
Name: A, dtype: int64

In [11]:
Test_data[['A']]

    A
R1  1
R2  6
R3  3
R4  5
R5  2
R6  4
R7  3
R8  1

In [12]:
Test_data[['A','B']]

    A  B
R1  1  2
R2  6  3
R3  3  7
R4  5  4
R5  2  2
R6  4  4
R7  3  2
R8  1  1

In [13]:
Test_data.iloc[0]

A      1
B      2
C    3.0
D      4
Name: R1, dtype: object

In [14]:
Test_data.loc['R1']

A      1
B      2
C    3.0
D      4
Name: R1, dtype: object

In [15]:
Test_data.iloc[[0]]

    A  B    C  D
R1  1  2  3.0  4

In [16]:
Test_data.iloc[[0]]

    A  B    C  D
R1  1  2  3.0  4

In [17]:
Test_data['A'][0]

1

In [18]:
Test_data.iloc[1,2]

2.0

In [19]:
Test_data.loc[lambda df: df['A'] > 2, :]

    A  B    C    D
R2  6  3  2.0  NaN
R3  3  7  1.0    1
R4  5  4  2.0    q
R6  4  4  0.0    m
R7  3  2  NaN    w

In [20]:
Test_data.index[[0, 2]]

Index(['R1', 'R3'], dtype='object')

In [21]:
Test_data.loc[Test_data.index[[0, 2]], 'A']

R1    1
R3    3
Name: A, dtype: int64

In [22]:
Test_data.sample(n=1, axis=1)

    B
R1  2
R2  3
R3  7
R4  4
R5  2
R6  4
R7  2
R8  1

In [23]:
Test_data['E'] = [11,12,13,14,15,16,17,18]
Test_data

    A  B    C    D   E
R1  1  2  3.0    4  11
R2  6  3  2.0  NaN  12
R3  3  7  1.0    1  13
R4  5  4  2.0    q  14
R5  2  2  6.0    7  15
R6  4  4  0.0    m  16
R7  3  2  NaN    w  17
R8  1  1  5.0    5  18

In [24]:
Test_data.loc['R9']=[101,102,103,104,105]
Test_data

      A    B      C    D    E
R1    1    2    3.0    4   11
R2    6    3    2.0  NaN   12
R3    3    7    1.0    1   13
R4    5    4    2.0    q   14
R5    2    2    6.0    7   15
R6    4    4    0.0    m   16
R7    3    2    NaN    w   17
R8    1    1    5.0    5   18
R9  101  102  103.0  104  105